gloomyandy/CoreN2G/src/STM32/AsyncSerial.cpp
//author: Andy
#if USE_UART0 || USE_UART1 || USE_UART2
#include <CoreImp.h>
#include <CoreNotifyIndices.h>
#include "AsyncSerial.h"
extern "C" void debugPrintf(const char* fmt, ...) __attribute__ ((format (printf, 1, 2)));

#if USE_UART0
TASKMEM AsyncSerial UART_Slot0;
#endif
#if USE_UART1
TASKMEM AsyncSerial UART_Slot1;
#endif
#if USE_UART2
TASKMEM AsyncSerial UART_Slot2;
#endif



AsyncSerial::AsyncSerial() noexcept
{
    uart = nullptr;
    prio = 0;
    txWaitingTask = nullptr;
    txEnabled = false;
    onTransmissionEndedFn = nullptr;
}


int8_t AsyncSerial::GetUARTPortNumber() noexcept
{
    return get_port_number();
}

bool AsyncSerial::Configure(Pin rx, Pin tx) noexcept
{
    //Find the UART based on the confgured Pins
    void* rxDev = pinmap_peripheral(rx, PinMap_UART_RX);
    void* txDev = pinmap_peripheral(tx, PinMap_UART_TX);

    if (rxDev != nullptr && (rxDev == txDev))
    {
        pin_rx = rx;
        pin_tx = tx;
        return true;
    }
    return false;    
}

void AsyncSerial::begin(uint32_t baud, uint8_t config) noexcept
{
    uint32_t databits = 0;
    uint32_t stopbits = 0;
    uint32_t parity = 0;

    // Manage databits
    switch (config & 0x07) 
    {
    case 0x02:
        databits = 6;
        break;
    case 0x04:
        databits = 7;
        break;
    case 0x06:
        databits = 8;
        break;
    default:
        databits = 0;
        break;
    }

    if ((config & 0x30) == 0x30) 
    {
        parity = UART_PARITY_ODD;
        databits++;
    } 
    else if ((config & 0x20) == 0x20) 
    {
        parity = UART_PARITY_EVEN;
        databits++;
    } 
    else 
    {
        parity = UART_PARITY_NONE;
    }

    if ((config & 0x08) == 0x08) 
    {
        stopbits = UART_STOPBITS_2;
    } 
    else 
    {
        stopbits = UART_STOPBITS_1;
    }

    switch (databits) 
    {
    #ifdef UART_WORDLENGTH_7B
        case 7:
        databits = UART_WORDLENGTH_7B;
        break;
    #endif
        case 8:
        databits = UART_WORDLENGTH_8B;
        break;
        case 9:
        databits = UART_WORDLENGTH_9B;
        break;
        default:
        case 0:
        Error_Handler();
        break;
    }

    init( (uint32_t)baud, databits, parity, stopbits);
    if (uart != nullptr)
    {
        rx_head = 0;
        rx_tail = 0;
        tx_head = 0;
        tx_tail = 0;
        txEnabled = true;
        start_rx();
    }
}

void AsyncSerial::begin(uint32_t baud) noexcept
{
    begin(baud, SERIAL_8N1);
}

void AsyncSerial::end(void) noexcept
{
    if (uart != nullptr)
    {
        // wait for transmission of outgoing data
        flush();

        deinit();

        // clear any received data
        rx_head = rx_tail = 0;
    }
}

int AsyncSerial::read(void) noexcept
{
    if (uart != nullptr)
    {
        // if the head isn't ahead of the tail, we don't have any characters
        if (rx_head == rx_tail) 
        {
            return -1;
        } 
        else 
        {
            unsigned char c = rx_buff[rx_tail];
            rx_tail = (rx_tail + 1) % SERIAL_RX_BUFFER_SIZE;
            return c;
        }
    }

    return -1;
}

int AsyncSerial::peek(void) noexcept
{
    if (uart != nullptr)
    {
        if (rx_head == rx_tail) 
        {
            return -1;
        } 
        else 
        {
            return rx_buff[rx_tail];
        }
    }
    
    return -1;
}

int AsyncSerial::available(void) noexcept
{
    if (uart != nullptr)
    {
        return rx_available();
    }
    return 0;
}

int AsyncSerial::availableForWrite(void) noexcept
{
    if (uart != nullptr)
    {
        return tx_available();
    }
    return 0;
}


size_t AsyncSerial::canWrite() noexcept
{
    if (uart != nullptr)
    {
        return availableForWrite();
    }
    return 0;
}

size_t AsyncSerial::write(const uint8_t c) noexcept
{
    if (uart != nullptr)
    {
        uint32_t i = (tx_head + 1) % SERIAL_TX_BUFFER_SIZE;
        if (i == tx_tail && !txEnabled)
        {
            return 0;
        }
        // If the output buffer is full, there's nothing for it other than to
        // wait for the interrupt handler to empty it a bit
        while (i == tx_tail) 
        {
            // nop, the interrupt handler will free up space for us
#ifdef RTOS
            txWaitingTask = RTOSIface::GetCurrentTask();
            TaskBase::TakeIndexed(NotifyIndices::UartTx, 50);
#endif
        }

        tx_buff[tx_head] = c;
        tx_head = i;

        if (!serial_tx_active()) 
        {
            start_tx();
        }

        return 1;
    }

    return 1;
}


size_t AsyncSerial::writeBlock(const uint8_t *buffer, size_t size) noexcept
{
    uint32_t head = tx_head;
    uint32_t tail = tx_tail;
    size_t toCopy = (SERIAL_TX_BUFFER_SIZE - 1 - head + tail) % SERIAL_TX_BUFFER_SIZE;

    if (toCopy > size) toCopy = size;
    if (toCopy > 0)
    {
        size_t toCopyNext;
        if (head >= tail)
        {
            size_t toCopyFirst = SERIAL_TX_BUFFER_SIZE - head;
            if (toCopy < toCopyFirst)
            {
                memcpy(&(tx_buff[head]), buffer, toCopy);
                tx_head = head + toCopy;
                return toCopy;
            }
            memcpy(&(tx_buff[head]), buffer, toCopyFirst);
            head = 0;
            toCopyNext = toCopy - toCopyFirst;
            buffer += toCopyFirst;
        }
        else
            toCopyNext = toCopy;
        memcpy(&(tx_buff[head]), buffer, toCopyNext);
        tx_head = head + toCopyNext;
    }
    return toCopy;
}

size_t AsyncSerial::write(const uint8_t *buffer, size_t size) noexcept
{
    if (uart != nullptr)
    {
        size_t ret = size;
        for(;;)
        {
            size_t len = writeBlock(buffer, size);
            size -= len;
            buffer += len;
            if (!txEnabled)
            {
                break;
            }
            if (len && !serial_tx_active())
                start_tx();
            if (size == 0)
            {
                break;
            }
#ifdef RTOS
            txWaitingTask = RTOSIface::GetCurrentTask();
            TaskBase::TakeIndexed(NotifyIndices::UartTx, 50);
#endif
        }
        return ret;
    }

    return size;
}

