gloomyandy/CoreN2G/src/STM32/AsyncSerial.cpp
}

int8_t AsyncSerial::get_port_number() noexcept
{
#if defined(USART1_BASE)
    if (uart == USART1) {
        return 1;
    }
#endif
#if defined(USART2_BASE)
    else if (uart == USART2) {
        return 2;
 }
#endif
#if defined(USART3_BASE)
    else if (uart == USART3) {
        return 3;
    }
#endif
#if defined(UART4_BASE)
    else if (uart == UART4) {
        return 4;
    }
#elif defined(USART4_BASE)
    else if (uart == USART4) {
        return 4;
    }
#endif
#if defined(UART5_BASE)
    else if (uart == UART5) {
        return 5;
    }
#elif defined(USART5_BASE)
    else if (uart == USART5) {
        return 5;
    }
#endif
#if defined(USART6_BASE)
    else if (uart == USART6) {
        return 6;
    }
#endif
#if defined(LPUART1_BASE)
    else if (uart == LPUART1) {
        return 1;
    }
#endif
#if defined(UART7_BASE)
    else if (uart == UART7) {
        return 7;
    }
#elif defined(USART7_BASE)
    else if (uart == USART7) {
        return 7;
    }
#endif
#if defined(UART8_BASE)
    else if (uart == UART8) {
        return 8;
    }
#elif defined(USART8_BASE)
    else if (uart == USART8) {
        return 8;
    }
#endif
#if defined(UART9_BASE)
    else if (uart == UART9) {
        return 9;
    }
#endif
#if defined(UART10_BASE)
    else if (uart == UART10) {
        return 10;
    }
#endif
    return -1;
}

uint8_t AsyncSerial::serial_rx_active() noexcept
{
    return ((HAL_UART_GetState(&handle) & HAL_UART_STATE_BUSY_RX) == HAL_UART_STATE_BUSY_RX);
}

uint8_t AsyncSerial::serial_tx_active() noexcept
{
    return ((HAL_UART_GetState(&handle) & HAL_UART_STATE_BUSY_TX) == HAL_UART_STATE_BUSY_TX);
}


void AsyncSerial::start_rx() noexcept
{
    /* Exit if a reception is already on-going */
    if (serial_rx_active()) {
        return;
    }
    HAL_UART_Receive_IT(&handle, &(rx_buff[0]), SERIAL_RX_BUFFER_SIZE);
}

void AsyncSerial::start_tx() noexcept
{
    if (!serial_tx_active() && tx_tail != tx_head) {
        HAL_UART_Transmit_IT(&handle, &tx_buff[tx_tail], 1);
    }
}

void AsyncSerial::set_interrupt_priority( uint32_t priority) noexcept
{
    HAL_NVIC_SetPriority(irq, priority, 0);
}


uint32_t AsyncSerial::rx_available() noexcept
{
    return ((uint32_t)(rx_head - rx_tail)) % SERIAL_RX_BUFFER_SIZE;
}

uint32_t AsyncSerial::tx_available() noexcept
{
    return ((uint32_t)(tx_tail + SERIAL_TX_BUFFER_SIZE - 1 - tx_head)) % SERIAL_TX_BUFFER_SIZE;
}

inline void AsyncSerial::UART_ErrorCallback() noexcept
{
    /* Restart receive interrupt after any error */
    hw_error++;
    if (!serial_rx_active()) {
        HAL_UART_Receive_IT(&handle, &(rx_buff[rx_head]), 1);
    }
}

inline HAL_StatusTypeDef AsyncSerial::UART_Receive_IT() noexcept
{
#if STM32H7
    uint8_t val = (uint8_t)(handle.Instance->RDR & (uint8_t)0x00FF);
#else
    uint8_t val = (uint8_t)(handle.Instance->DR & (uint8_t)0x00FF);
#endif
    uint32_t pos = (rx_head + 1) % SERIAL_RX_BUFFER_SIZE;
    if (pos != rx_tail)
    {
        rx_buff[rx_head] = val;
        rx_head = pos;
    }
    else
        rx_full++;
    return HAL_OK;
}

inline HAL_StatusTypeDef AsyncSerial::UART_Transmit_IT() noexcept
{
    if (tx_tail != tx_head)
    {
        // write the data
#if STM32H7
        handle.Instance->TDR = tx_buff[tx_tail];
#else
        handle.Instance->DR = tx_buff[tx_tail];
#endif
        // update write pointer
        tx_tail = (tx_tail + 1) % SERIAL_TX_BUFFER_SIZE;
    }
    // do we have more to send?
    if (tx_tail == tx_head)
    {
        /* Disable the UART Transmit empty Interrupt */
        __HAL_UART_DISABLE_IT(&handle, UART_IT_TXE);

        /* Enable the UART Transmit Complete Interrupt */
        __HAL_UART_ENABLE_IT(&handle, UART_IT_TC);
    }
#if RTOS
    if (txWaitingTask != nullptr && tx_available() >= SERIAL_TX_BUFFER_SIZE/2)
    {
        TaskBase::GiveFromISR(txWaitingTask, NotifyIndices::UartTx);
        txWaitingTask = nullptr;
    }
#endif


    return HAL_OK;
}

inline HAL_StatusTypeDef AsyncSerial::UART_EndTransmit_IT() noexcept
{
    // has more data arrived while we waited?
    if (tx_tail != tx_head)
    {
        // Yes so send the data
#if STM32H7
        handle.Instance->TDR = tx_buff[tx_tail];
#else
        handle.Instance->DR = tx_buff[tx_tail];
#endif
        // update write pointer
        tx_tail = (tx_tail + 1) % SERIAL_TX_BUFFER_SIZE;
        // do we have more to send?
        if (tx_tail != tx_head)
        {
            /* Enable the UART Transmit empty Interrupt */
            __HAL_UART_ENABLE_IT(&handle, UART_IT_TXE);
            __HAL_UART_DISABLE_IT(&handle, UART_IT_TC);
        }
        return HAL_OK;
    }
    // No data left to send
    /* Disable the UART Transmit Complete Interrupt */
    __HAL_UART_DISABLE_IT(&handle, UART_IT_TC);
    /* Tx process is ended, restore handle.gState to Ready */
    handle.gState = HAL_UART_STATE_READY;
    if (onTransmissionEndedFn != nullptr)					// if we want callback when the transmitter is empty
    {
        onTransmissionEndedFn(onTransmissionEndedCp);	// execute the callback
    }
    return HAL_OK;
}

void AsyncSerial::UART_IRQHandler() noexcept
{
#if STM32H7
    uint32_t isrflags = READ_REG(handle.Instance->ISR);
    uint32_t errorflags = (isrflags & (uint32_t)(USART_ISR_PE | USART_ISR_FE | USART_ISR_ORE | USART_ISR_NE | USART_ISR_RTOF));
#else
    uint32_t isrflags = READ_REG(handle.Instance->SR);
    uint32_t errorflags = (isrflags & (uint32_t)(UART_FLAG_PE | UART_FLAG_FE | UART_FLAG_ORE | UART_FLAG_NE));
#endif
    uint32_t cr1its = READ_REG(handle.Instance->CR1);
    uint32_t cr3its         = READ_REG(handle.Instance->CR3);

    /* If no error occurs */
    if (errorflags == RESET)
    {
        /* UART in mode Receiver -------------------------------------------------*/
        if (((isrflags & UART_FLAG_RXNE) != RESET) && ((cr1its & USART_CR1_RXNEIE) != RESET))
        {
            UART_Receive_IT();
            return;
        }
    }

    /* If some errors occur */
// FIXME: This is a mess different flags on H7/F4
#if STM32H7
    if ((errorflags != 0U)
            && ((((cr3its & (USART_CR3_RXFTIE | USART_CR3_EIE)) != 0U) || ((cr1its & (USART_CR1_RXNEIE_RXFNEIE | USART_CR1_PEIE | USART_CR1_RTOIE)) != 0U))))
    {
        /* UART parity error interrupt occurred -------------------------------------*/
        if (((isrflags & USART_ISR_PE) != 0U) && ((cr1its & USART_CR1_PEIE) != 0U))
        {
            __HAL_UART_CLEAR_FLAG(&handle, UART_CLEAR_PEF);
            handle.ErrorCode |= HAL_UART_ERROR_PE;
        }

        /* UART frame error interrupt occurred --------------------------------------*/
        if (((isrflags & USART_ISR_FE) != 0U) && ((cr3its & USART_CR3_EIE) != 0U))
        {
            __HAL_UART_CLEAR_FLAG(&handle, UART_CLEAR_FEF);
            handle.ErrorCode |= HAL_UART_ERROR_FE;
        }

        /* UART noise error interrupt occurred --------------------------------------*/
        if (((isrflags & USART_ISR_NE) != 0U) && ((cr3its & USART_CR3_EIE) != 0U))
        {
            __HAL_UART_CLEAR_FLAG(&handle, UART_CLEAR_NEF);
            handle.ErrorCode |= HAL_UART_ERROR_NE;
        }

        /* UART Over-Run interrupt occurred -----------------------------------------*/
        if (((isrflags & USART_ISR_ORE) != 0U) && (((cr1its & USART_CR1_RXNEIE_RXFNEIE) != 0U) || ((cr3its & (USART_CR3_RXFTIE | USART_CR3_EIE)) != 0U)))
        {
            __HAL_UART_CLEAR_FLAG(&handle, UART_CLEAR_OREF);
            handle.ErrorCode |= HAL_UART_ERROR_ORE;
        }

        /* UART Receiver Timeout interrupt occurred ---------------------------------*/
        if (((isrflags & USART_ISR_RTOF) != 0U) && ((cr1its & USART_CR1_RTOIE) != 0U))
        {
            __HAL_UART_CLEAR_FLAG(&handle, UART_CLEAR_RTOF);
            handle.ErrorCode |= HAL_UART_ERROR_RTO;
        }

